app/views/hackathons/_hackathon_table.html.haml

      %th Attendees
    - @user = User.find_by_username(params[:username])
---
SELECT "users".* FROM "users" WHERE "users"."hackathon_id" = 1 AND "users"."username" = 'lawrence.jones.353' LIMIT 1