app/controllers/hackathons_controller.rb

  def index
    @hackathons = Hackathon.all
---
SELECT "hackathons".* FROM "hackathons"

  def show
    @hackathon = Hackathon.find(params[:id])
---
SELECT "hackathons".* FROM "hackathons" WHERE "hackathons"."id" = $1 LIMIT 1  [["id", "1"]]

  def create
    hack = params[:hackathon]
    @hackathon = Hackathon.find_by_eid hack[:eid]
    if @hackathon.blank?
      @hackathon = Hackathon.create(:eid => hack[:eid],
        :name => hack[:name], :description => hack[:description],
        :location => hack[:location], :start => hack[:start_time], :end => hack[:end_time])
---
INSERT INTO "hackathons" ("created_at", "desc", "end", "location", "name", "scheduleItems", "start", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def subscribed_to
    needs_update = false
    if !params[:eids].nil?
      params[:eids].each do |eid|
        @hackathon = Hackathon.find_by_eid(eid)
        if !@hackathon.blank?
          @user = @hackathon.users.find_by_username params[:username]
---
SELECT "users".* FROM "users" WHERE "users"."hackathon_id" = 1 AND "users"."username" = 'lawrence.jones.353' LIMIT 1

  def delete_all
    Hackathon.delete_all
---
DELETE FROM "hackathons"