app/controllers/schedule_items_controller.rb

SELECT "schedule_items".* FROM "schedule_items"
---
  def index
    @schedule_items = ScheduleItem.all

SELECT "schedule_items".* FROM "schedule_items" WHERE "schedule_items"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def show
    @schedule_item = ScheduleItem.find(params[:id])

SELECT "schedule_items".* FROM "schedule_items" WHERE "schedule_items"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def edit
    @schedule_item = ScheduleItem.find(params[:id])

INSERT INTO "schedule_items" ("created_at", "iconUrl", "isMajor", "name", "time", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @schedule_item = ScheduleItem.new(params[:schedule_item])

    respond_to do |format|
      if @schedule_item.save

SELECT "schedule_items".* FROM "schedule_items" WHERE "schedule_items"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "schedule_items" SET "time" = '1367154000000', "updated_at" = '2013-04-28 08:33:13.785268' WHERE "schedule_items"."id" = 1
---
  def update
    @schedule_item = ScheduleItem.find(params[:id])

    respond_to do |format|
      if @schedule_item.update_attributes(params[:schedule_item])