app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = 'todge2' LIMIT 1
INSERT INTO "users" ("created_at", "email", "name", "updated_at", "username") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
	def create
		@user = User.find_by_username params[:user][:username]
    puts 'Giving data'
    if params[:giving_details]
      puts 'Giving data'
      @user[:github_email] = params[:user][:github_email]
      @user[:tags] = params[:user][:tags]
      @user[:signed_up] = true
      if @user.save